In [1]:
#import library
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [13]:
#upload csv file
df = pd.read_csv('online.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.shape

(50, 5)

In [4]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [5]:
#if missing valu... then solve it
# missing = df.Administration.mean()
# df.Administration = df.Administration.fillna(missing)

# seperate X,Y (x-defend value, y- indefend value)

In [6]:
x = df.drop(['Profit'], axis=1)

In [15]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [16]:
y = df['Profit']

In [17]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# One Hot Encoding

In [21]:
city = pd.get_dummies(x['Area'], drop_first=True)

In [23]:
city.head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [24]:
#drop area column
x = x.drop('Area', axis=1)

In [25]:
x.head()

   Marketing Spend  Administration  Transport
0        114523.61       136897.80  471784.10
1        162597.70       151377.59  443898.53
2        153441.51       101145.55  407934.54
3        144372.41       118671.85  383199.62
4        142107.34        91391.77  366168.42

In [26]:
#concat (x, city) table
x = pd.concat([x,city], axis=1)

In [27]:
x.head()

   Marketing Spend  Administration  Transport  Dhaka  Rangpur
0        114523.61       136897.80  471784.10      1        0
1        162597.70       151377.59  443898.53      0        0
2        153441.51       101145.55  407934.54      0        1
3        144372.41       118671.85  383199.62      1        0
4        142107.34        91391.77  366168.42      0        1

In [29]:
from sklearn.model_selection import train_test_split

In [37]:
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size=.25, random_state=0)

In [38]:
xtrain.head()

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
34         46426.07       157693.92  210797.67      0        0
18         91749.16       114175.79  294919.57      0        1
7         130298.13       145530.06  323876.68      0        1
14        119943.24       156547.42  256512.92      0        1
45          1000.23       124153.04    1903.93      1        0

In [39]:
xtest.head()

    Marketing Spend  Administration  Transport  Dhaka  Rangpur
28         66051.52       182645.56  118148.20      0        1
11        100671.96        91790.61  249744.55      0        0
10        101913.08       110594.11  229160.95      0        1
41         27892.92        84710.77  164470.71      0        1
2         153441.51       101145.55  407934.54      0        1

In [40]:
ytrain.head()

34     96712.80
18    124266.90
7     155752.60
14    132602.65
45     64926.08
Name: Profit, dtype: float64

In [41]:
ytest.head()

28    103282.38
11    144259.40
10    146121.95
41     77798.83
2     191050.39
Name: Profit, dtype: float64

In [42]:
from sklearn.linear_model import LinearRegression

In [43]:
reg = LinearRegression()

In [44]:
reg.fit(xtrain, ytrain)

LinearRegression()

In [45]:
pred = reg.predict(xtest)

In [46]:
pred

array([103501.0825284 , 128011.28068627, 126695.43891127,  70573.91718775,
       173381.96874259, 124238.07860872,  69298.09250304,  98399.41936876,
       116419.1480864 , 161430.98134847,  94740.73303076,  89920.22800514,
       105956.86065332])

In [51]:
reg.score(xtest, ytest)

0.8840978623923469

# R-squared value

In [48]:
from sklearn.metrics import r2_score

In [49]:
score = r2_score(ytest, pred)

In [50]:
score

0.8840978623923469